//*****************************************************
//
// ゴールエディターの処理[editGoal.h]
// Author:髙山桃也
//
//*****************************************************

//*****************************************************
// インクルード
//*****************************************************
#include "edit.h"

//*****************************************************
// クラスの定義
//*****************************************************
class CEditGoal : public CEdit
{
public:
	CEditGoal();
	~CEditGoal();

	HRESULT Init(void) override;
	void Uninit(void) override;
	void Update(void) override;

private:
};