//*****************************************************
//
// エディターの処理[edit.cpp]
// Author:髙山桃也
//
//*****************************************************

//*****************************************************
// インクルード
//*****************************************************
#include "edit.h"
#include "debugproc.h"
#include "player.h"

//*****************************************************
// 定数定義
//*****************************************************
namespace
{
const float SPEED_MOVE = 10.0f;	// 移動速度
const float ABOVE_DEFAULT = 10000.0f;	// デフォルトの上空視点の高さ
const float SPEED_MOVE_PLAYER = 10.0f;	// プレイヤーの移動速度
}

//*****************************************************
// 静的メンバ変数宣言
//*****************************************************

//=====================================================
// コンストラクタ
//=====================================================
CEdit::CEdit()
{
	m_pos = { 0.0f,0.0f,0.0f };
	m_rot = { 0.0f,0.0f,0.0f };
}

//=====================================================
// デストラクタ
//=====================================================
CEdit::~CEdit()
{

}

//=====================================================
// 初期化処理
//=====================================================
HRESULT CEdit::Init(void)
{
	return S_OK;
}

//=====================================================
// 終了処理
//=====================================================
void CEdit::Uninit(void)
{
	
}

//=====================================================
// 更新処理
//=====================================================
void CEdit::Update(void)
{
	// プレイヤーのテレポート
	TeleportPlayer();
}

//=====================================================
// プレイヤーのテレポート
//=====================================================
void CEdit::TeleportPlayer(void)
{
	if (ImGui::TreeNode("TeleportPlayer"))
	{
		CPlayer *pPlayer = CPlayer::GetInstance();

		if (pPlayer == nullptr)
			return;

		D3DXVECTOR3 posPlayer = pPlayer->GetPosition();

		// ImGuiによる位置の変更
		ImGui::DragFloat("PosPlayer.X", &posPlayer.x, SPEED_MOVE_PLAYER, -FLT_MAX, FLT_MAX);
		ImGui::DragFloat("PosPlayer.Y", &posPlayer.y, SPEED_MOVE_PLAYER, -FLT_MAX, FLT_MAX);
		ImGui::DragFloat("PosPlayer.Z", &posPlayer.z, SPEED_MOVE_PLAYER, -FLT_MAX, FLT_MAX);

		// マウスでの位置変更


		pPlayer->SetPosition(posPlayer);

		ImGui::TreePop();
	}
}