//*****************************************************
//
// 敵の処理[enemy.h]
// Author:髙山桃也
//
//*****************************************************
#ifndef _ENEMY_H_
#define _ENEMY_H_

//*****************************************************
// インクルード
//*****************************************************
#include "mob.h"

//*****************************************************
// クラスの定義
//*****************************************************
class CEnemy : public CMob
{
public:
	CEnemy(int nPriority = 4);	// コンストラクタ
	~CEnemy();	// デストラクタ

	// メンバ関数
	HRESULT Init(void);	// 初期化
	void Uninit(void);	// 終了
	void Update(void);	// 更新
	void Draw(void);	// 描画

	// 変数取得・設定関数

	// 静的メンバ関数

private:
	// メンバ変数
};

#endif