//*****************************************************
//
// モブの処理[mob.cpp]
// Author:髙山桃也
//
//*****************************************************
#ifndef _MOB_H_
#define _MOB_H_

//*****************************************************
// インクルード
//*****************************************************
#include "motion.h"

//*****************************************************
// 前方宣言
//*****************************************************

//*****************************************************
// クラスの定義
//*****************************************************
class CMob : public CMotion
{
public:
	CMob(int nPriority = 4);	// コンストラクタ
	~CMob();	// デストラクタ

	// メンバ関数
	HRESULT Init(void);	// 初期化
	void Uninit(void);	// 終了
	void Update(void);	// 更新
	void Draw(void);	// 描画

	// 静的メンバ関数
	static CMob *Create(void);	// 生成処理

private:
	// メンバ関数

	// メンバ変数
};

#endif