//*****************************************************
//
// 武器の処理[weapon.cpp]
// Author:髙山桃也
//
//*****************************************************
#ifndef _WEAPON_H_
#define _WEAPON_H_

//*****************************************************
// インクルード
//*****************************************************
#include "ObjectX.h"

//*****************************************************
// 前方宣言
//*****************************************************

//*****************************************************
// クラスの定義
//*****************************************************
class CWeapon : public CObjectX
{
public:
	CWeapon(int nPriority = 6);	// コンストラクタ
	~CWeapon();	// デストラクタ

	// メンバ関数
	HRESULT Init(void);	// 初期化
	void Uninit(void);	// 終了
	void Update(void);	// 更新
	void Draw(void);	// 描画

	// 静的メンバ関数
	static CWeapon *Create(string stPath);

private:
	// メンバ変数
};

#endif
